// Структуры данных
// Структурами данных называеют некоторый контейнер с данными,обладающий спецефическим внутренним устройством (макетом) и логикой храненияю
// Различные макеты могут быть эффективны для некоторых операций и неэффективны для других.
// Массив - это контейнер, хранящий данные идентифицируемыепо индексу.
//      К любому элементу массива всегда можно обратиться по его индексу и достать или заменить его.
// Особенностью массива является то, что доступ к элементам по индексу осуществляется за константное время, т.е. имеет сложность O(1)
// Основные операции с массивами
//  - простые алгоритмы сортировки
//  - алгоритмы поиска
//  - продвинутые алгоритмы сортировки

 